{
  "backend/main.mo": "Motoko canister implementing alumni profiles, events, and announcements with admin/approval-based access control and CRUD operations.",
  "feature_evidence.json": "Feature evidence report mapping feature requests to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend components, hooks, and pages.",
  "frontend/index.css": "Tailwind CSS setup defining light/dark theme design tokens and global base styles.",
  "frontend/index.html": "Basic HTML entry file mounting the React app and loading the main TypeScript bundle.",
  "frontend/src/App.tsx": "Main React app configuring routing, theme provider, and global toaster notifications.",
  "frontend/src/components/admin/MembersAdminPanel.tsx": "Admin panel to view member approval statuses and approve or reject users with confirmation dialogs.",
  "frontend/src/components/AdminOnly.tsx": "Component that conditionally renders children only for admins and shows an access-denied fallback otherwise.",
  "frontend/src/components/AlumniCard.tsx": "UI card displaying summary details of an alumni profile with click handling.",
  "frontend/src/components/AlumniProfileDetailDialog.tsx": "Dialog for viewing full alumni profile details including bio, location, and contact info.",
  "frontend/src/components/AlumniProfileForm.tsx": "Form component for creating or editing an alumni profile with validation and submit handling.",
  "frontend/src/components/AnnouncementAdminPanel.tsx": "Admin panel trigger that opens a dialog for creating new announcements.",
  "frontend/src/components/AnnouncementCard.tsx": "Displays an announcement with title, date badge, and formatted content.",
  "frontend/src/components/AnnouncementComposerDialog.tsx": "Dialog for composing and submitting a new announcement using a mutation hook.",
  "frontend/src/components/AppFooter.tsx": "Site footer showing copyright and a link to caffeine.ai.",
  "frontend/src/components/AppHeader.tsx": "Main site header with navigation, user menu, mobile menu, and auth controls.",
  "frontend/src/components/AppLayout.tsx": "Page layout wrapper providing header, footer, and main content area.",
  "frontend/src/components/AuthButton.tsx": "Login/logout button handling Internet Identity auth state and actions.",
  "frontend/src/components/DirectoryFilters.tsx": "Filter panel for alumni directory with search, year, and department selectors.",
  "frontend/src/components/EventAdminPanel.tsx": "Admin panel trigger that opens a dialog to create a new event.",
  "frontend/src/components/EventCard.tsx": "Card component showing event details including date, time, location, and description.",
  "frontend/src/components/EventEditorDialog.tsx": "Dialog UI for creating, updating, and deleting events with form handling and mutation calls.",
  "frontend/src/components/RequireApproved.tsx": "Wrapper component that checks authentication and approval state, showing gated UI or children accordingly.",
  "frontend/src/components/RequireAuth.tsx": "Component that blocks access until user is authenticated, showing a sign‑in prompt or custom fallback.",
  "frontend/src/hooks/useAccess.ts": "Hook combining auth, approval, and admin checks into a unified access-control state.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on identity, refetching dependent queries on change.",
  "frontend/src/hooks/useCurrentUser.ts": "Hook exposing current user identity, profile, and loading state derived from Internet Identity and profile query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provider and hooks managing Internet Identity authentication, login flow, and stored identities.",
  "frontend/src/hooks/useIsAdmin.ts": "Hook querying backend to determine whether the authenticated caller is an admin.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating alumni profiles, events, announcements, and related data via the backend actor.",
  "frontend/src/index.css": "Defines Tailwind base styles and CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/ActivitiesPage.tsx": "Renders a static list of alumni activities with categorized cards and details.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Displays the admin dashboard with permission-controlled tabs for managing members, content, and events.",
  "frontend/src/pages/AnnouncementsPage.tsx": "Fetches and displays announcements with loading and empty states.",
  "frontend/src/pages/DirectoryPage.tsx": "Shows a searchable and filterable directory of alumni profiles with detail view support.",
  "frontend/src/pages/EventsPage.tsx": "Renders upcoming and past events with tabs, loading states, and event cards, requiring approved access.",
  "frontend/src/pages/GalleryPage.tsx": "Displays a placeholder gallery grid for approved users with optional empty state handling.",
  "frontend/src/pages/LandingPage.tsx": "Landing page showcasing features, hero section, and navigation actions based on authentication.",
  "frontend/src/pages/MyProfilePage.tsx": "Allows approved users to view, create, or edit their profile with loading and save handling.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, layout, animations, and plugins.",
  "project_state.json": "Defines project state, requirements, architectural notes, and known issues for building the Gurukul Alumni Association app with RBAC, member approval, and content management."
}