{
  "backend/main.mo": "Defines backend actor with types and storage for alumni profiles, events, announcements, gallery images, activities, snapshots, and admin/approval checks.",
  "feature_evidence.json": "Lists feature evidence for frontend snapshot table updates and React Query hooks with related files and metadata.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for many frontend components, pages, and hooks.",
  "frontend/index.css": "Tailwind CSS setup defining theme variables for light and dark modes.",
  "frontend/index.html": "Basic HTML entry point loading the React application root and main script.",
  "frontend/src/App.tsx": "Configures TanStack Router routes and wraps the app in theme and toaster providers.",
  "frontend/src/components/admin/ActivitiesAdminPanel.tsx": "Admin panel listing activities with options to create, edit, and delete entries.",
  "frontend/src/components/admin/ActivityEditorDialog.tsx": "Dialog for creating, updating, or deleting an activity with validation and photo management.",
  "frontend/src/components/admin/GalleryAdminPanel.tsx": "Admin interface to view, add, edit, and delete gallery images.",
  "frontend/src/components/admin/GalleryEditorDialog.tsx": "Dialog component for creating, editing, or deleting gallery images with validation and mutation hooks.",
  "frontend/src/components/admin/MembersAdminPanel.tsx": "Admin panel for viewing and updating member approval statuses with filtering, confirmations, and reactive queries.",
  "frontend/src/components/AdminOnly.tsx": "Renders children only for admin users, otherwise shows an access denied card or fallback.",
  "frontend/src/components/AlumniCard.tsx": "Displays a clickable alumni profile summary card with name, year, department, and location.",
  "frontend/src/components/AlumniProfileDetailDialog.tsx": "Modal dialog showing full alumni profile details including bio and contact info.",
  "frontend/src/components/AlumniProfileForm.tsx": "Form component for creating or editing an alumni profile with validation and submit handling.",
  "frontend/src/components/AnnouncementAdminPanel.tsx": "Admin panel button that opens a dialog for creating announcements.",
  "frontend/src/components/AnnouncementCard.tsx": "Displays an announcement with title, date, and content inside a styled card.",
  "frontend/src/components/AnnouncementComposerDialog.tsx": "Dialog for composing and publishing a new announcement with form validation and mutation handling.",
  "frontend/src/components/AppFooter.tsx": "Footer displaying branding information and the current build version.",
  "frontend/src/components/AppHeader.tsx": "Main site header with navigation, user menu, admin links, and mobile menu support.",
  "frontend/src/components/AppLayout.tsx": "Wraps pages with a header, footer, and main content layout.",
  "frontend/src/components/AuthButton.tsx": "Authentication button handling login, logout, and loading states using Internet Identity.",
  "frontend/src/components/BackendUnavailableCard.tsx": "Error card shown when backend is unreachable, offering a retry button.",
  "frontend/src/components/BuildVersionLabel.tsx": "Displays the current build version string.",
  "frontend/src/components/DirectoryFilters.tsx": "Filter panel for the alumni directory with search, year, and department selectors.",
  "frontend/src/components/EventAdminPanel.tsx": "Admin panel allowing creation of events via an event editor dialog.",
  "frontend/src/components/EventCard.tsx": "Displays event details including date, time, location, and optional past status.",
  "frontend/src/components/EventEditorDialog.tsx": "Dialog component for creating, editing, and deleting events with form handling and mutation calls.",
  "frontend/src/components/RequireApproved.tsx": "Protects content by requiring authentication and admin approval, handling backend status and error states.",
  "frontend/src/components/RequireAuth.tsx": "Wrapper enforcing user authentication, showing loading or sign‑in prompts when needed.",
  "frontend/src/config/buildInfo.ts": "Exports the build version string pulled from environment variables.",
  "frontend/src/config/superAdmins.ts": "Defines and checks a principal allowlist for super-admin access.",
  "frontend/src/hooks/useAccess.ts": "Aggregates authentication, approval, admin, and backend readiness into a unified access-control state.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance based on Internet Identity, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useBackendSnapshots.ts": "Hooks for listing, creating, deleting, and clearing backend snapshots via the actor.",
  "frontend/src/hooks/useBackendStatus.ts": "Tracks backend readiness with timeout handling and provides a retry mechanism.",
  "frontend/src/hooks/useBackendSummary.ts": "Fetches backend status information once the actor and authentication are ready.",
  "frontend/src/hooks/useCurrentUser.ts": "Returns current user identity, profile, and loading states derived from Internet Identity and profile query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context and logic for login, logout, and identity persistence.",
  "frontend/src/hooks/useIsAdmin.ts": "Determines admin status using super-admin allowlist and backend check via actor.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating alumni data, events, announcements, departments, and activities through the backend actor.",
  "frontend/src/index.css": "Defines Tailwind base styles and CSS variables for light and dark themes used throughout the app.",
  "frontend/src/main.tsx": "Bootstraps the React app and wraps it with Internet Identity and React Query providers.",
  "frontend/src/pages/ActivitiesPage.tsx": "Displays a list of activities using useGetActivities, handling loading, errors, and empty states.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Renders the admin dashboard with tabs for managing members, content, and events, gated by admin access checks.",
  "frontend/src/pages/AnnouncementsPage.tsx": "Shows announcements with backend readiness checks and handles loading, errors, and empty results.",
  "frontend/src/pages/BackendPage.tsx": "Admin page for viewing, creating, deleting, and clearing backend snapshots with confirmation dialogs and toast notifications.",
  "frontend/src/pages/DirectoryPage.tsx": "Page that loads alumni profiles with filtering, search, backend status handling, and profile detail dialogs.",
  "frontend/src/pages/EventsPage.tsx": "Displays upcoming and past events with tabs, loading states, and backend retry handling.",
  "frontend/src/pages/GalleryPage.tsx": "Loads and displays gallery images with error handling and a fallback when no items exist.",
  "frontend/src/pages/LandingPage.tsx": "Public landing page with hero section, feature cards, and navigation buttons based on authentication.",
  "frontend/src/pages/MyProfilePage.tsx": "Loads and edits the authenticated user's profile with form handling, saving, and backend status checks.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, persisting, and clearing URL and session-based parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, custom OKLCH color variables, extended theming, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project’s state, goals, architecture notes, known issues, and existing feature requirements for the alumni association app."
}