{
  "backend/main.mo": "Defines the main canister with access control, user approval, and CRUD maps for alumni profiles, events, announcements, gallery images, and activities.",
  "backend/migration.mo": "Migration module converting old actor state to new state by adding gallery and activity maps and initializing new ID counters.",
  "feature_evidence.json": "Feature evidence report listing implemented features, associated files, components, tests, and confidence metadata.",
  "frontend-file-summaries.txt": "JSON-like text providing high-level summaries for major frontend files and components.",
  "frontend/index.css": "Tailwind base and theme variable definitions for light and dark mode using CSS custom properties.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps the app in ThemeProvider and Toaster components.",
  "frontend/src/components/admin/ActivitiesAdminPanel.tsx": "Admin panel listing activities with options to create, edit, or delete them using ActivityEditorDialog.",
  "frontend/src/components/admin/ActivityEditorDialog.tsx": "Dialog for creating, editing, or deleting activities, including title, description, and photo URL management.",
  "frontend/src/components/admin/GalleryAdminPanel.tsx": "Admin interface for managing gallery images, allowing creation, editing, and deletion via GalleryEditorDialog.",
  "frontend/src/components/admin/GalleryEditorDialog.tsx": "Dialog component for creating, editing, and deleting gallery images with validation and mutation hooks.",
  "frontend/src/components/admin/MembersAdminPanel.tsx": "Admin panel for viewing and managing member approval statuses with filtering and confirmation dialogs.",
  "frontend/src/components/AdminOnly.tsx": "Conditional wrapper that renders children only for admin users, otherwise showing an access-denied card.",
  "frontend/src/components/AlumniCard.tsx": "Card UI component displaying a compact alumni profile summary with name, year, department, and location.",
  "frontend/src/components/AlumniProfileDetailDialog.tsx": "Dialog component presenting full alumni profile details including contact info, bio, and location.",
  "frontend/src/components/AlumniProfileForm.tsx": "Form component for creating or editing an alumni profile with validation and submit handling.",
  "frontend/src/components/AnnouncementAdminPanel.tsx": "Admin panel with a button to open the announcement composer dialog.",
  "frontend/src/components/AnnouncementCard.tsx": "Displays an announcement's title, date, and content in a styled card.",
  "frontend/src/components/AnnouncementComposerDialog.tsx": "Dialog for creating announcements with form state, validation, and mutation handling.",
  "frontend/src/components/AppFooter.tsx": "Footer showing copyright info and the build version label.",
  "frontend/src/components/AppHeader.tsx": "Responsive site header with navigation, auth controls, and mobile menu.",
  "frontend/src/components/AppLayout.tsx": "Layout wrapper combining the app header, footer, and page content.",
  "frontend/src/components/AuthButton.tsx": "Button that handles login and logout using Internet Identity with loading states.",
  "frontend/src/components/BackendUnavailableCard.tsx": "Error card shown when backend connectivity fails, offering a retry button.",
  "frontend/src/components/BuildVersionLabel.tsx": "Displays the current build version from configuration.",
  "frontend/src/components/DirectoryFilters.tsx": "UI controls for filtering the alumni directory by name, year, and department.",
  "frontend/src/components/EventAdminPanel.tsx": "Admin panel for creating events via the event editor dialog.",
  "frontend/src/components/EventCard.tsx": "Displays event details including date, time, location, and description, with past-event styling.",
  "frontend/src/components/EventEditorDialog.tsx": "Dialog form for creating, updating, and deleting events with validation and backend mutation hooks.",
  "frontend/src/components/RequireApproved.tsx": "Wrapper component that checks authentication, backend availability, and approval status before rendering children, showing appropriate prompts or errors.",
  "frontend/src/components/RequireAuth.tsx": "Ensures a user is authenticated before rendering children, showing a loading state or sign‑in prompt when needed.",
  "frontend/src/config/buildInfo.ts": "Exports the build version string from environment variables.",
  "frontend/src/hooks/useAccess.ts": "Hook that aggregates authentication, approval, and admin status into a unified access-control object.",
  "frontend/src/hooks/useActor.ts": "Initializes and manages the backend actor, refetching dependent queries when the identity changes.",
  "frontend/src/hooks/useBackendStatus.ts": "Tracks backend readiness with timeout handling and provides a retry mechanism.",
  "frontend/src/hooks/useCurrentUser.ts": "Hook that exposes the current user's identity, principal strings, and profile loading state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context with login, logout, and status tracking using AuthClient.",
  "frontend/src/hooks/useIsAdmin.ts": "Queries whether the current authenticated caller is an admin.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for interacting with backend actors for profiles, events, approvals, and gallery actions.",
  "frontend/src/index.css": "Sets Tailwind layers and defines light/dark theme CSS variables for colors, borders, and global styling.",
  "frontend/src/main.tsx": "Initializes React app root with React Query and Internet Identity context providers, then renders App.",
  "frontend/src/pages/ActivitiesPage.tsx": "Fetches and displays activities with loading/error states, showing cards with titles, descriptions, and optional photos.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Renders admin dashboard with permission checks, tabbed management panels, and loading/error handling.",
  "frontend/src/pages/AnnouncementsPage.tsx": "Loads and displays announcements with backend status checks, handling loading, empty, and error states.",
  "frontend/src/pages/DirectoryPage.tsx": "Provides searchable and filterable alumni directory with backend checks and profile detail dialog support.",
  "frontend/src/pages/EventsPage.tsx": "Displays upcoming and past events in tabbed layout with backend checks and loading/error handling.",
  "frontend/src/pages/GalleryPage.tsx": "Displays a gallery of images with loading/error states and a fallback when no items are available, using RequireApproved for access control.",
  "frontend/src/pages/LandingPage.tsx": "Renders the public landing page with hero content, feature cards, authentication-aware buttons, and navigation actions.",
  "frontend/src/pages/MyProfilePage.tsx": "Allows an authenticated approved user to create or edit their alumni profile with backend status checks, loading states, and save handling.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading URL parameters, persisting them in sessionStorage, and managing hash-based query cleanup.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, fonts, animations, plugins, and content paths for styling.",
  "project_state.json": "Stores project metadata, feature definitions, issues, and architectural notes for the alumni app’s build state."
}