{
  "kind": "build_request",
  "title": "Persist Backend page status data in a database-like table with history",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-40",
      "text": "Add a persistent, database-like backend data model to store Backend page status snapshots (a \"sheet/table\" of rows) inside the Motoko canister state, where each row includes a unique id, a capturedAt timestamp, and the same count fields currently returned by getBackendStatus (profiles, events, announcements, gallery images, activities, approved users, pending users). Access must be admin-only.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "You create the backend page, but I need the data to be stored in a database, like in a sheet or table."
        ]
      },
      "acceptanceCriteria": [
        "Backend compiles and deploys with a new persisted snapshot table/collection stored in-canister (no external database).",
        "Each snapshot row contains: id, capturedAt timestamp, totalAlumniProfiles, totalEvents, totalAnnouncements, totalGalleryImages, totalActivities, totalApprovedUsers, totalPendingUsers.",
        "All snapshot read/write APIs are protected by the existing adminGuard (admins only)."
      ]
    },
    {
      "id": "REQ-41",
      "text": "Implement backend APIs to manage the stored backend status snapshots so the data can be viewed and managed as a table: (1) create/capture a new snapshot row, (2) list snapshot rows (most recent first), and (3) delete a snapshot row and/or clear all snapshots.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "i need in database things. like sheet or table"
        ]
      },
      "acceptanceCriteria": [
        "There is an admin-only update call that captures the current backend status and appends it as a new stored row.",
        "There is an admin-only query call that returns the list of stored snapshot rows, ordered newest-to-oldest.",
        "There is an admin-only method to delete a single snapshot (by id) and/or clear all snapshots.",
        "Error messages for missing ids are explicit (e.g., \"Snapshot does not exist\")."
      ]
    },
    {
      "id": "REQ-42",
      "text": "Ensure the new backend snapshot storage is upgrade-safe and does not erase any existing deployed state (profiles, events, announcements, approvals, authorization data). Add conditional upgrade/migration handling only if required by the current persistence approach.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "I need the data to be stored in a database, like in a sheet or table."
        ]
      },
      "acceptanceCriteria": [
        "After an upgrade, existing application data remains available (profiles/events/announcements/gallery/activities/approvals/admin access).",
        "After an upgrade, previously captured backend status snapshots (if any existed) remain available.",
        "If a migration is introduced, it is conditional and preserves existing state."
      ]
    },
    {
      "id": "REQ-43",
      "text": "Update the existing admin-only Backend page (frontend/src/pages/BackendPage.tsx) to display the stored backend status snapshots in a clear table (sheet-like) view, including captured timestamp and all count columns, and provide controls to: (1) capture a new snapshot row, (2) refresh the table, and (3) delete a row and/or clear all rows. Use English user-facing text.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "I need the data to be stored in a database, like in a sheet or table."
        ]
      },
      "acceptanceCriteria": [
        "Backend page shows a table of persisted snapshot rows (not just the current live counts).",
        "The page includes a \"Capture Snapshot\" action that adds a new row and updates the table.",
        "The page includes row deletion and a \"Clear All\" action (with a confirmation step) and updates the table after changes.",
        "All error/empty/loading states are in English; when there are no rows, an explicit empty state is shown (e.g., \"No snapshots yet\")."
      ]
    },
    {
      "id": "REQ-44",
      "text": "Add React Query hooks (or extend existing hooks) to fetch and mutate backend status snapshots, following existing patterns in frontend/src/hooks (actor availability checks, no unauthenticated querying, and proper cache invalidation after mutations).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "I need the data to be stored in a database, like in a sheet or table."
        ]
      },
      "acceptanceCriteria": [
        "Snapshot queries do not run unless an actor is available and the user is authenticated (consistent with useBackendSummary enabled logic).",
        "After capturing/deleting/clearing snapshots, the snapshot list query is invalidated/refetched so the table updates without a full page reload.",
        "Failure states surface a readable error message and allow retry (consistent with existing BackendPage error UI patterns)."
      ]
    }
  ],
  "constraints": [
    "Do not add or depend on any external database (e.g., Google Sheets, PostgreSQL, MongoDB); persistence must be inside the Motoko canister state.",
    "Keep all Motoko logic in the single backend actor (backend/main.mo).",
    "Do not edit files under frontend/src/components/ui or other paths listed in frontend.immutablePaths; compose existing UI components instead.",
    "All user-facing text must be in English."
  ],
  "nonGoals": [
    "Adding real-time updates/streaming logs on the Backend page.",
    "Exporting snapshots to CSV/Excel or integrating with Google Sheets.",
    "Introducing additional backend diagnostics beyond storing and displaying the requested table of status snapshots."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}