{
  "kind": "build_request",
  "title": "Fix app stuck on loading by preventing anonymous backend queries and adding clear error states",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-20",
      "text": "Prevent the app from getting stuck in a perpetual loading state by ensuring user/profile/admin/approval React Query hooks do not run (and do not contribute to loading spinners) when the user is not authenticated.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "app is ony showing loading"
        ]
      },
      "acceptanceCriteria": [
        "When signed out, navigating to any protected route (e.g., /directory, /events, /announcements, /my-profile, /gallery, /activities) shows the expected \"Authentication Required\" UI (or the membership approval UI after login), not an indefinite \"Loading...\" spinner.",
        "When signed out, the app does not fire backend queries for current user profile, approval status, or admin status.",
        "When signed in, current user profile / approval / admin checks still run and the protected pages behave as before."
      ]
    },
    {
      "id": "REQ-21",
      "text": "Update the auth/approval gating UI to handle backend/query failures gracefully: if approval/admin/profile checks fail or the backend cannot be reached, show an explicit error message with a retry action instead of showing an infinite loading indicator.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "app is ony showing loading"
        ]
      },
      "acceptanceCriteria": [
        "If backend calls needed for a protected page fail (e.g., actor creation succeeds but queries error), the page displays an English error state (e.g., \"Unable to load data. Please try again.\") and provides a retry button.",
        "Retrying re-attempts the failed query/queries and can recover without a full page reload.",
        "Loading spinners are only shown while a request is actually in-flight (no permanent loading caused by disabled/blocked queries)."
      ]
    },
    {
      "id": "REQ-22",
      "text": "Ensure that the landing page (\"/\") renders reliably even if the backend is slow/unavailable by removing any dependency on backend queries for its initial render and by not showing a full-page loading state there.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "app is ony showing loading"
        ]
      },
      "acceptanceCriteria": [
        "Visiting \"/\" always renders the landing page content without a full-page \"Loading...\" state, regardless of backend availability.",
        "The header and landing page still correctly reflect authenticated vs unauthenticated state once Internet Identity finishes initializing."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/hooks/useInternetIdentity.ts (immutable path).",
    "Do not modify files under frontend/src/hooks/useActor.ts (immutable path).",
    "Keep the backend as a single Motoko actor (no additional canisters/services).",
    "All user-facing text must be in English."
  ],
  "nonGoals": [
    "Adding new features unrelated to the loading issue.",
    "Changing the approved-member workflow rules or relaxing authorization requirements.",
    "Introducing external logging/monitoring or third-party services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}