{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Admin-managed Gallery and Acts & Activities (frontend)",
  "requirements": [
    {
      "id": "REQ-32",
      "summary": "Add React Query hooks to list and admin-mutate Gallery and Activities content with auth/actor gating and cache invalidation.",
      "acceptanceCriteria": [
        "frontend/src/hooks/useQueries.ts includes hooks to list Gallery items and list Activities items.",
        "frontend/src/hooks/useQueries.ts includes hooks for admin-only mutations to create/update/delete Gallery items and Activities items.",
        "All new queries are disabled when the actor is not ready and do not run when the user is not authenticated (consistent with existing hooks that gate by identity).",
        "Successful mutations invalidate the relevant list query keys so the pages refresh without manual reload."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add React Query hooks for Gallery and Activities using existing patterns: useInternetIdentity gating (no unauthenticated querying), actor availability checks, and list query invalidation on create/update/delete. Add list hooks for backend-driven reads (e.g., getGalleryImages/getActivities) and admin mutation hooks (create/update/delete) with query keys like ['galleryImages'] and ['activities']. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-33",
      "summary": "Render Gallery and Activities pages from backend-driven content with RequireApproved gating, plus empty/error states and retry.",
      "acceptanceCriteria": [
        "/gallery renders a list/grid of Gallery items retrieved from the backend and no longer uses the placeholder Array.from(...) items.",
        "/activities renders a list/grid of Activities items retrieved from the backend and no longer uses the hardcoded placeholder array.",
        "Both pages remain wrapped in RequireApproved.",
        "If the backend returns zero items, each page shows an English empty-state message (e.g., \"No gallery items yet.\" / \"No activities yet.\").",
        "If the backend is unavailable or the query fails, the page shows an English error state with a retry action (consistent with the app’s existing backend-unavailable patterns)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/GalleryPage.tsx",
          "operation": "modify",
          "description": "Replace placeholder gallery array with backend-driven query hook usage (from useQueries.ts) and follow existing loading/error patterns (e.g., BackendUnavailableCard with retry). Keep RequireApproved wrapper, render a grid/list of returned items, and show a clear English empty state when no items exist. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/ActivitiesPage.tsx",
          "operation": "modify",
          "description": "Replace hardcoded activities array with backend-driven query hook usage (from useQueries.ts) and follow existing loading/error patterns (e.g., BackendUnavailableCard with retry). Keep RequireApproved wrapper, render a grid/list of returned items, and show a clear English empty state when no items exist. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-34",
      "summary": "Add admin dashboard UI to create/edit/delete Gallery and Activities items with validation, admin-only access, and live refresh via query invalidation.",
      "acceptanceCriteria": [
        "Admin Dashboard provides a clear way for admins to add new Gallery items and Activities items.",
        "Admin Dashboard provides a way for admins to edit and delete existing Gallery items and Activities items.",
        "Admin content management UI is only accessible to admins (consistent with current admin gating behavior).",
        "All admin forms validate required fields and display English inline errors or toast feedback on failure.",
        "After creating/updating/deleting an item, the corresponding list updates without a full page refresh."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/GalleryAdminPanel.tsx",
          "operation": "create",
          "description": "Create an admin panel to manage Gallery items: list existing items, provide actions to add/edit/delete, and connect to the new Gallery query/mutation hooks. Use the app’s existing authorization-driven admin gating via AdminDashboardPage/useAccess (authorization component capability: role-based admin access). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/admin/GalleryEditorDialog.tsx",
          "operation": "create",
          "description": "Create a dialog-based form for Gallery create/edit (and a delete confirmation flow) using existing shadcn/ui building blocks and sonner toasts for English success/failure feedback. Validate required fields (e.g., title, image URL) before mutation submission. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/admin/ActivitiesAdminPanel.tsx",
          "operation": "create",
          "description": "Create an admin panel to manage Activities items: list existing items, provide actions to add/edit/delete, and connect to the new Activities query/mutation hooks. Use the app’s existing authorization-driven admin gating via AdminDashboardPage/useAccess (authorization component capability: role-based admin access). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/admin/ActivityEditorDialog.tsx",
          "operation": "create",
          "description": "Create a dialog-based form for Activities create/edit (and a delete confirmation flow) using existing shadcn/ui building blocks and sonner toasts for English success/failure feedback. Validate required fields (e.g., title, description; optional photo URLs list) before mutation submission. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/AdminDashboardPage.tsx",
          "operation": "modify",
          "description": "Wire the new Gallery and Activities admin panels into the existing Admin Dashboard 'Content' tab (alongside Announcement Management) using the same admin-only gating already enforced by useAccess/isAdmin. Ensure the new panels are reachable and not orphaned, and that list refresh happens via React Query invalidation after mutations. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}