{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Admin Backend page: persisted backend status snapshots table UI + React Query hooks",
  "requirements": [
    {
      "id": "REQ-43",
      "summary": "Update the admin-only Backend page to show persisted backend status snapshots in a table with capture/refresh/delete/clear controls",
      "acceptanceCriteria": [
        "Backend page shows a table of persisted snapshot rows (not just the current live counts).",
        "The page includes a \"Capture Snapshot\" action that adds a new row and updates the table.",
        "The page includes row deletion and a \"Clear All\" action (with a confirmation step) and updates the table after changes.",
        "All error/empty/loading states are in English; when there are no rows, an explicit empty state is shown (e.g., \"No snapshots yet\")."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/BackendPage.tsx",
          "operation": "modify",
          "description": "Replace the live-only status cards with an admin-only, sheet-like snapshots table view driven by the persisted snapshot APIs. Use the existing admin gating (AdminOnly) tied to the authorization component’s role checks (Verify the component's usage instructions before implementing). Add actions: Capture Snapshot (calls snapshot create mutation), Refresh (refetches snapshots query), Delete per row (calls delete mutation), and Clear All (calls clear mutation with an explicit confirmation step). Ensure English-only UI strings and include explicit loading, error (with retry), and empty states (e.g., \"No snapshots yet\")."
        }
      ]
    },
    {
      "id": "REQ-44",
      "summary": "Add React Query hooks to query and mutate backend status snapshots with actor/auth guards and cache invalidation",
      "acceptanceCriteria": [
        "Snapshot queries do not run unless an actor is available and the user is authenticated (consistent with useBackendSummary enabled logic).",
        "After capturing/deleting/clearing snapshots, the snapshot list query is invalidated/refetched so the table updates without a full page reload.",
        "Failure states surface a readable error message and allow retry (consistent with existing BackendPage error UI patterns)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useBackendSnapshots.ts",
          "operation": "create",
          "description": "Create dedicated React Query hooks for persisted backend snapshots: a list query hook (newest-first ordering assumed from backend) and mutation hooks for capture/create, delete-by-id, and clear-all. Follow existing patterns used by useBackendSummary/useQueries: (1) guard queries with actor availability and authentication (via useActor + useInternetIdentity), (2) throw readable errors when actor is unavailable in mutations, and (3) invalidate/refetch the snapshots list query key after successful mutations. Use existing authorization-driven admin-only access behavior in the UI layer (Verify the component's usage instructions before implementing)."
        }
      ]
    }
  ]
}