{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Admin photo uploads (Data URLs) for Gallery/Activities and improved in-page photo viewing",
  "requirements": [
    {
      "id": "REQ-51",
      "summary": "Add device photo pickers to Gallery and Activity admin editors, converting selected images to Data URLs while preserving existing URL-based inputs and admin gating.",
      "acceptanceCriteria": [
        "Gallery editor supports selecting an image file from disk and shows a preview before saving.",
        "Saving a gallery item after selecting a file persists the image by storing a Data URL in `imageUrl` (no backend schema/API changes required).",
        "Activity editor supports selecting one or multiple image files from disk and adds them to the photos list as Data URLs.",
        "Activity editor still supports adding photos by URL (existing behavior preserved).",
        "All new/updated labels, helper text, and validation messages are in English.",
        "Admin-only access behavior remains unchanged (only users with the existing content permissions can create/edit)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/GalleryEditorDialog.tsx",
          "operation": "modify",
          "description": "Add an image file input (accept PNG/JPG/WebP) that converts the selected file to a Data URL and stores it into the existing `imageUrl` field; include an inline image preview (works for both Data URLs and regular URLs) and keep all user-facing text in English."
        },
        {
          "path": "frontend/src/components/admin/ActivityEditorDialog.tsx",
          "operation": "modify",
          "description": "Add one or more image file pickers (support multiple selection) that convert selected files to Data URLs and append them to the existing `photos: string[]` list; preserve the existing URL add/remove photo behavior and keep all user-facing text in English."
        },
        {
          "path": "frontend/src/utils/imageDataUrl.ts",
          "operation": "create",
          "description": "Create shared helpers to read File objects as Data URLs and provide reusable utilities for image upload flows (e.g., reading a file safely and returning a Data URL string)."
        }
      ]
    },
    {
      "id": "REQ-52",
      "summary": "Add client-side validation for admin photo uploads (MIME type + max size) and display English helper notes about embedded image storage and performance.",
      "acceptanceCriteria": [
        "Selecting an unsupported file type shows an English validation error and does not add/set the photo.",
        "Selecting a file larger than the configured limit shows an English validation error and does not add/set the photo.",
        "Gallery dialog and Activity dialog show a short English helper note about embedded images and performance/size considerations.",
        "Existing create/update flows still work when using URL inputs only (no regression)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/imageDataUrl.ts",
          "operation": "modify",
          "description": "Add validation helpers for allowed image MIME types (PNG/JPG/WebP) and a clear max file size constant; expose functions that dialogs can use to validate before converting to Data URLs."
        },
        {
          "path": "frontend/src/components/admin/GalleryEditorDialog.tsx",
          "operation": "modify",
          "description": "Enforce allowed MIME types and max file size for the new file picker; show English validation messages when invalid; add an English helper note that uploaded images are embedded in app data and large images may be slow."
        },
        {
          "path": "frontend/src/components/admin/ActivityEditorDialog.tsx",
          "operation": "modify",
          "description": "Enforce allowed MIME types and max file size for selected files before appending as Data URLs; show English validation messages when invalid; add an English helper note that uploaded images are embedded in app data and large images may be slow."
        }
      ]
    },
    {
      "id": "REQ-53",
      "summary": "Add a modal/lightbox photo viewer for Gallery and Activities pages with English controls and basic keyboard accessibility, without changing existing RequireApproved gating.",
      "acceptanceCriteria": [
        "Clicking a gallery image opens a modal/lightbox with a larger preview and English-labeled controls (at minimum: Close; plus Next/Previous for gallery).",
        "Clicking an activity photo opens a modal/lightbox with a larger preview and an English-labeled Close control.",
        "Lightbox is keyboard-accessible at a basic level (Escape closes).",
        "No changes to the approval/auth gating: `/gallery` and `/activities` remain behind the existing `RequireApproved` pattern."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/PhotoLightboxDialog.tsx",
          "operation": "create",
          "description": "Create a reusable lightbox/modal component (compose existing UI dialog primitives; do not edit `frontend/src/components/ui`) that can display a large image with title/description and English-labeled Close/Next/Previous actions; support Escape-to-close."
        },
        {
          "path": "frontend/src/pages/GalleryPage.tsx",
          "operation": "modify",
          "description": "Wire gallery cards to open the new PhotoLightboxDialog on click, showing the selected image larger with title/description and Next/Previous navigation across the current gallery list; ensure English labels for Close/Next/Previous and preserve the existing RequireApproved wrapper."
        },
        {
          "path": "frontend/src/pages/ActivitiesPage.tsx",
          "operation": "modify",
          "description": "Wire activity photo thumbnails to open the new PhotoLightboxDialog on click, showing the selected photo larger with an English-labeled Close control (and optionally allow navigation within that activity’s photos); preserve the existing RequireApproved wrapper."
        }
      ]
    }
  ]
}