{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Stop anonymous access queries, add access-check error UI, and make landing render backend-independent",
  "requirements": [
    {
      "id": "REQ-20",
      "summary": "Disable profile/approval/admin React Query hooks when unauthenticated so signed-out users see auth-required UI instead of infinite loading.",
      "acceptanceCriteria": [
        "When signed out, navigating to any protected route (e.g., /directory, /events, /announcements, /my-profile, /gallery, /activities) shows the expected \"Authentication Required\" UI (or the membership approval UI after login), not an indefinite \"Loading...\" spinner.",
        "When signed out, the app does not fire backend queries for current user profile, approval status, or admin status.",
        "When signed in, current user profile / approval / admin checks still run and the protected pages behave as before."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update access-related hooks (useGetCallerUserProfile, useIsCallerApproved, useListApprovals, etc.) to support an explicit `enabled` gate driven by authentication state (from Internet Identity), so queries do not run and do not contribute to loading UI while signed out. Verify the component's usage instructions before implementing (authorization + user-approval guidance about not fetching app data before login)."
        },
        {
          "path": "frontend/src/hooks/useIsAdmin.ts",
          "operation": "modify",
          "description": "Gate the admin-status query so it never runs and never reports loading when the user is unauthenticated (use Internet Identity authentication state to control query enablement). Verify the component's usage instructions before implementing (authorization guidance)."
        },
        {
          "path": "frontend/src/hooks/useCurrentUser.ts",
          "operation": "modify",
          "description": "Stop calling the current-user profile query when signed out; compute `isAuthenticated` directly from Internet Identity identity and only enable profile fetching when authenticated so signed-out routes do not get stuck in profile-loading. Verify the component's usage instructions before implementing (authorization guidance about clearing cached profile on logout)."
        },
        {
          "path": "frontend/src/hooks/useAccess.ts",
          "operation": "modify",
          "description": "Rework aggregated access loading state so approval/admin checks only participate in loading when authenticated; avoid `isLoading` being true due solely to disabled queries. Verify the component's usage instructions before implementing (authorization + user-approval access gating)."
        },
        {
          "path": "frontend/src/components/RequireApproved.tsx",
          "operation": "modify",
          "description": "Adjust gating logic so the unauthenticated state renders the \"Authentication Required\" UI immediately (no spinner) and so loading spinners only appear when authenticated and access checks are actually in-flight. Verify the component's usage instructions before implementing (authorization + user-approval flow)."
        },
        {
          "path": "frontend/src/pages/AdminDashboardPage.tsx",
          "operation": "modify",
          "description": "Ensure admin dashboard loading state is not driven by admin/approval queries when signed out (rely on updated useAccess/RequireApproved behavior) so it cannot show an indefinite spinner for unauthenticated users. Verify the component's usage instructions before implementing (authorization + user-approval admin gating)."
        }
      ]
    },
    {
      "id": "REQ-21",
      "summary": "Add explicit error states and retry actions for approval/admin/profile access checks so failures do not present as infinite loading.",
      "acceptanceCriteria": [
        "If backend calls needed for a protected page fail (e.g., actor creation succeeds but queries error), the page displays an English error state (e.g., \"Unable to load data. Please try again.\") and provides a retry button.",
        "Retrying re-attempts the failed query/queries and can recover without a full page reload.",
        "Loading spinners are only shown while a request is actually in-flight (no permanent loading caused by disabled/blocked queries)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Stop swallowing errors for access-critical queries (profile + approval checks) so error information is available to the UI (e.g., expose `error`, `isError`, and `refetch` from React Query). Keep user-facing text in English. Verify the component's usage instructions before implementing (authorization + user-approval error handling guidance)."
        },
        {
          "path": "frontend/src/hooks/useIsAdmin.ts",
          "operation": "modify",
          "description": "Expose query error state and a refetch/retry mechanism for admin checks instead of returning false on failure, so the UI can display an explicit error and retry. Keep user-facing text in English. Verify the component's usage instructions before implementing (authorization error handling guidance)."
        },
        {
          "path": "frontend/src/hooks/useAccess.ts",
          "operation": "modify",
          "description": "Include error aggregation for access checks (profile/approval/admin), and expose a single `retry()` (or individual refetch functions) that the UI can call from a Retry button without full page reload. Verify the component's usage instructions before implementing (authorization + user-approval gating)."
        },
        {
          "path": "frontend/src/components/RequireApproved.tsx",
          "operation": "modify",
          "description": "Add an explicit English error state when authenticated but access checks (approval/profile) fail, including a Retry button that triggers the appropriate query refetch via updated hooks (no full reload). Ensure spinner is only shown when requests are in-flight. Verify the component's usage instructions before implementing (authorization + user-approval access control UI guidance)."
        },
        {
          "path": "frontend/src/pages/AdminDashboardPage.tsx",
          "operation": "modify",
          "description": "Add an explicit English error state for admin access determination failures (via updated useAccess), with a Retry button to re-run the admin/access queries. Ensure no permanent loading when queries are disabled/blocked. Verify the component's usage instructions before implementing (authorization + user-approval admin gating)."
        },
        {
          "path": "frontend/src/components/admin/MembersAdminPanel.tsx",
          "operation": "modify",
          "description": "Add an explicit English error state and Retry action for the approvals list query (admin-only) rather than failing silently to an empty list on backend/query errors; retry should refetch without a full page reload. Verify the component's usage instructions before implementing (user-approval admin dashboard guidance)."
        }
      ]
    },
    {
      "id": "REQ-22",
      "summary": "Make the landing page render without any backend-query dependency and avoid full-page loading there even if backend is slow/unavailable.",
      "acceptanceCriteria": [
        "Visiting \"/\" always renders the landing page content without a full-page \"Loading...\" state, regardless of backend availability.",
        "The header and landing page still correctly reflect authenticated vs unauthenticated state once Internet Identity finishes initializing."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useCurrentUser.ts",
          "operation": "modify",
          "description": "Ensure landing and header can render using Internet Identity initialization state without requiring backend queries: only fetch profile when authenticated, and avoid reporting a global loading state on unauthenticated landing render. Keep user-facing text in English. Verify the component's usage instructions before implementing (authorization guidance about not fetching app data before login)."
        },
        {
          "path": "frontend/src/hooks/useAccess.ts",
          "operation": "modify",
          "description": "Ensure access aggregation does not trigger backend queries on initial landing render when unauthenticated, and does not propagate a loading state that could be used for full-page spinners. Verify the component's usage instructions before implementing (authorization + user-approval gating)."
        },
        {
          "path": "frontend/src/components/AppHeader.tsx",
          "operation": "modify",
          "description": "Adjust header logic so authenticated vs unauthenticated rendering does not rely on access checks that can fail/timeout; ensure admin link logic remains correct once authenticated while header stays responsive even if backend is unavailable. Verify the component's usage instructions before implementing (authorization + user-approval role/approval checks)."
        },
        {
          "path": "frontend/src/pages/LandingPage.tsx",
          "operation": "modify",
          "description": "Confirm landing page content renders immediately with no backend query dependency; if any auth-derived loading UI exists or is introduced, ensure it is not a full-page blocking spinner and only reflects Internet Identity initialization. Keep all user-facing text in English."
        }
      ]
    }
  ]
}